In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn
np.random.seed(101)

rand_mat = randn(5,4)

In [3]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [4]:
pd.DataFrame(data=rand_mat, index="A B C D E".split())

          0         1         2         3
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [5]:
df = pd.DataFrame(data=rand_mat, index='A B C D E'.split(), columns="W X Y Z".split())

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [7]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [8]:
type(df['W'])

pandas.core.series.Series

In [9]:
mylist = ['W', 'Y']
df[mylist]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [10]:
type(df[mylist])

pandas.core.frame.DataFrame

In [11]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [12]:
df['NEW'] = df['W'] + df['Y']

In [13]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [14]:
df.drop('NEW', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [16]:
df.drop('NEW', axis=1, inplace=True)

In [17]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
df.drop('A')

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df.drop('A',inplace=True)

In [20]:
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [21]:
df.iloc[2]

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [22]:
df.loc[['B','C']]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [23]:
df.iloc[[2,3]]

          W         X         Y         Z
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
df.loc[['C','E']][['Y','Z']]

          Y         Z
C  0.528813 -0.589001
E  2.605967  0.683509

In [25]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df > 0

       W      X      Y      Z
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [27]:
df_bool = df > 0

In [28]:
df_bool

       W      X      Y      Z
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [29]:
df[df > 0]

          W         X         Y         Z
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df['W'] > 0

B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [31]:
# broadcast
df[df['W']> 0]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df[df['W']>0]['Y']

B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [38]:
df[df['W']>0]['Y'].loc['B']

-0.8480769834036315

In [39]:
df[df['Y']>0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [40]:
cond1 = df['W'] > 0

In [41]:
cond2 = df['Y'] > 1

In [42]:
df[ (cond1) & (cond2)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df.reset_index()

  index         W         X         Y         Z
0     B  0.651118 -0.319318 -0.848077  0.605965
1     C -2.018168  0.740122  0.528813 -0.589001
2     D  0.188695 -0.758872 -0.933237  0.955057
3     E  0.190794  1.978757  2.605967  0.683509

In [51]:
new_ind = 'CA NY WY OR'.split()

In [52]:
new_ind

['CA', 'NY', 'WY', 'OR']

In [53]:
df['States'] = new_ind

In [54]:
df

          W         X         Y         Z States
B  0.651118 -0.319318 -0.848077  0.605965     CA
C -2.018168  0.740122  0.528813 -0.589001     NY
D  0.188695 -0.758872 -0.933237  0.955057     WY
E  0.190794  1.978757  2.605967  0.683509     OR

In [55]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.651118 -0.319318 -0.848077  0.605965
NY     -2.018168  0.740122  0.528813 -0.589001
WY      0.188695 -0.758872 -0.933237  0.955057
OR      0.190794  1.978757  2.605967  0.683509